# Python SQL

## Motivação

Em geral, o acesso a um banco de dados é feito por intermédio de uma aplicação. Por exemplo, uma interface gráfica, uma API ou uma ferramenta CLI.

<center><img src="./images/sist-exe.png" alt="Sistema banco de dados" width="70%" height="70%"/></center>

Existem inúmeras ferramentas em forma de bibliotecas, frameworks e drivers que facilitam a comunicação entre uma aplicação e o banco de dados.

O objetivo dessas ferramentas é simplificar a integração do sistema com o banco de dados.

## Objetivos

Ao final desta aula o aluno deverá conhecer:

1. Como acessar o banco de dados via Jupyter Notebook.
1. A utilidade de bibliotecas para acesso ao BD.
1. As bibliotecas psycopg2 e sqlalchemy.

## Banco de dados no Jupyter

Este <a href="https://towardsdatascience.com/jupyter-magics-with-sql-921370099589">link</a> apresenta um tutorial de como configurar sua máquina para executar comandos SQL no Jupyter.

Note que este recurso serve apenas para o Jupyter entender comandos SQL. Portanto, não tem relação com as outras bibliotecas de acesso ao banco que veremos a seguir.

Após a instalação e configuração, será possível rodar os comandos abaixo.

In [1]:
%load_ext sql
%sql postgresql://postgres:admin@localhost/letscode
%sql SELECT 1 as "Test"

 * postgresql://postgres:***@localhost/letscode
1 rows affected.

[(1,)]

## Biblioteca psycopg2

<a href="https://www.psycopg.org/docs/">Psycopg</a> é um adaptador PostgreSQL para a linguagem Python.

Oferece recursos para realizar operações e consultas ao banco de dados utilizando a linguagem SQL.

In [21]:
import psycopg2

try:
    #conn = psycopg2.connect("dbname='template1' user='dbuser' host='localhost' password='dbpass'")
    conn = psycopg2.connect(database='escola',
            user='postgres',
            host='localhost',
            port=5432)
    print("Connected!")
except:
    print("I am unable to connect to the database")

Connected!

In [22]:
cur = conn.cursor()

cur.execute("""SELECT id_aluno, nome, email from aluno""")

rows = cur.fetchall()

print("\nShow me the results:\n")

for row in rows:
    print("   ", row, "\n")

Show me the results:

    (1, 'João', 'joao@gmail.com')

    (2, 'Maria', 'maria@hotmail.com')

    (3, 'Ana', 'ana@yahoo.com')

    (4, 'José', 'jose@qqcoisa.com')

    (5, 'Ivy', 'ivy@qqcoisa.com')

    (7, 'João', 'joao@gmail.com')

    (8, 'Maria', 'maria@hotmail.com')

    (100, 'João', 'joao@gmail.com')

    (500, 'João', 'joao@gmail.com')

In [26]:
import pandas as pd

pd.DataFrame(rows, columns=['id_aluno', 'nome', 'email'])

   id_aluno   nome              email
0         1   João     joao@gmail.com
1         2  Maria  maria@hotmail.com
2         3    Ana      ana@yahoo.com
3         4   José   jose@qqcoisa.com
4         5    Ivy    ivy@qqcoisa.com
5         7   João     joao@gmail.com
6         8  Maria  maria@hotmail.com
7       100   João     joao@gmail.com
8       500   João     joao@gmail.com

## Biblioteca sqlalchemy

<a href="https://docs.sqlalchemy.org/en/14/intro.html">Sqlalchemy</a> é uma biblioteca que oferece um "jeito Python" de interagir com banco de dados.

Então, ao invés de lidar com dialetos SQL específicos de um SGBD, podemos usar essa biblioteca para uma interação mais independente de plataforma.

Essa biblioteca consegue ler o esquema das tabelas e fazer um mapeamento para suas estruturas internas. 

Dessa forma, não é necessário escrever código SQL, já que a lib possui funções genéricas para consultas e demais operações com o banco de dados.

In [28]:
import sqlalchemy as db

engine = db.create_engine('postgresql://postgres:postgres@localhost/escola')

In [36]:
connection = engine.connect()
metadata = db.MetaData()

# lendo os metadados da tabela aluno
aluno = db.Table('aluno', metadata, autoload=True, autoload_with=engine)

# imprime o nome das colunas
print(aluno.columns.keys())

['id_aluno', 'nome', 'matricula', 'data_nascimento', 'email']

In [34]:
#Equivalente ao 'SELECT * FROM aluno'
query = db.select([aluno])

ResultProxy = connection.execute(query)
ResultSet = ResultProxy.fetchall()

ResultSet[:3]

[(1, 'João', '123', datetime.date(1998, 6, 7), 'joao@gmail.com'),
 (2, 'Maria', '456', datetime.date(1997, 5, 30), 'maria@hotmail.com'),
 (3, 'Ana', '789', datetime.date(2000, 1, 11), 'ana@yahoo.com')]

In [37]:
import pandas as pd

pd.DataFrame(ResultSet, columns=aluno.columns.keys())

   id_aluno   nome matricula data_nascimento              email
0         1   João       123      1998-06-07     joao@gmail.com
1         2  Maria       456      1997-05-30  maria@hotmail.com
2         3    Ana       789      2000-01-11      ana@yahoo.com
3         4   José       741      2001-06-13   jose@qqcoisa.com
4         5    Ivy       258      2011-08-26    ivy@qqcoisa.com
5         7   João       123      1998-06-07     joao@gmail.com
6         8  Maria       456      1997-05-30  maria@hotmail.com
7       100   João       123      1998-06-07     joao@gmail.com
8       500   João       123      1998-06-07     joao@gmail.com